[
  {
    "img": "/assets/experiences/hack&roll.webp",
    "color": "#000000",
    "icon": "schoolIcon",
    "date": "Jan 2024",
    "title": "Winner",
    "subtitle": "TEAMMATES (NUS OSS)",
    "desc": [
      "Developed a Real-Time Voice Interactive Chatbot for Central Provision Fund (CPF) Singapore, integrating TwiML, GPT-4, Pinecone, and embeddings to provide instant and accurate responses",
      "Emerging as winners among 200 competing teams."
    ]
  },
  {
    "img": "/assets/experiences/teammates.webp",
    "color": "#000000",
    "icon": "schoolIcon",
    "date": "Jan 2024 - Present",
    "title": "Software Engineer",
    "subtitle": "TEAMMATES (NUS OSS)",
    "desc": [
      "On pace to implement a major contribution to TEAMMATES, an online feedback management system for education used by more than 1,000,000 users as part of CS3281!"
    ]
  },
  {
    "img": "/assets/experiences/gdsc.webp",
    "color": "#000000",
    "icon": "schoolIcon",
    "date": "Sep 2023 - Present",
    "title": "Software Engineer",
    "subtitle": "Google Developer Student Clubs NUS (GDSC NUS)",
    "desc": [
      "Spearheaded the development of three key pages of a volunteer management system for MINDS Singapore.",
      "Single handedly created a data-table component with inbuilt faceted filtering and pagination and a global toast notification builder, both of which are used extensively in other routes."
    ]
  },
  {
    "img": "/assets/experiences/fintechNus.webp",
    "color": "#000000",
    "icon": "schoolIcon",
    "date": "Aug 2023 - Present",
    "title": "Software Engineer",
    "subtitle": "NUS Fintech Society",
    "desc": [
      "Lead frontend development in NextJS to visualise the capabilities of club generated Machine Learning models."
    ]
  },
  {
    "img": "/assets/experiences/freelance.webp",
    "color": "#000000",
    "icon": "workIcon",
    "date": "Nov 2022 - Aug 2023",
    "title": "Freelance IOS Developer",
    "subtitle": "Singapore",
    "desc": [
      "Successfully migrated existing codebase from Objective-C to Swift and implemented automated testing of Swift code.",
      "Spearheaded the Implementation of a Bluetooth Low-Energy (BLE) feature to integrate with existing codebase.",
      "Worked around the limitation of IOS by embedding additional encrypted data in BLE devices broadcast blasts, resulting in a significantly quicker authentication process."
    ]
  },
  {
    "img": "/assets/experiences/eusoff.webp",
    "color": "#000000",
    "icon": "schoolIcon",
    "date": "Aug 2022 - Mar 2023",
    "title": "Software Developer",
    "subtitle": "Eusoff Hall Hackers",
    "desc": [
      "Revamped Eusoff Hall's legacy software to incorporate modern development technologies and best practices.",
      "Examples of these software includes: Jersey bidding and Senior room bidding."
    ]
  },
  {
    "img": "/assets/experiences/cybersierra.webp",
    "color": "#000000",
    "icon": "workIcon",
    "date": "Feb 2022 - Aug 2022",
    "title": "Software Engineer Intern",
    "subtitle": "Cyber Sierra",
    "desc": [
      "Prototyped a cartography software that scans and maps companies footprints on cloud service providers such as AWS, Azure and Google Cloud Platform.",
      "Developed bots to train employees on aspects of cyber secuirty as well as combat the rampant spread of fake news."
    ]
  }
]
